title: impression
about: impression
artist: rajan kumar pant
museum: museum of nepali arts
imageID: 1

title: bhadgaon
about: Bhaktapur, known locally as Khwopa, is a city in the east corner of the Kathmandu Valley in Nepal located about 13 kilometres from the capital city, Kathmandu. In terms of area, Bhaktapur is the smallest district of Nepal.
artist: rajman singh chitrakar
museum: null
imageID: 2

title: akash yogini (bijesvari)
about: Akash Yogini is also called “Bijesvari” (wisdom goddess), and “Vidhyadhari Vajrayogini” (knowledge holder). She is seen in a flying position leaping towards the akash (sky). One of her legs is pointed towards the sky and her right leg is bent up at the knee without touching the ground. The Goddess’s left-hand goes under her left leg and carries a kapala (skull cup) and khatwanga (long studded club) which is sealed with a golden cross vajra, a nectar vase, impaled blue head of Bhairav, a human head, a dry white skull and a crowning half Vajra.
artist: raj prakash man tuladhar
museum: museum of nepali arts
imageID: 3

title: bodhisattva
about: In Buddhism, a bodhisattva or bodhisatva is a person who is on the path towards bodhi or Buddhahood.
artist: rajan sangachhe
museum: museum of nepali arts
imageID: 4

title: cultural heritage
about: Cultural heritage includes: cultures, customs, beliefs, rites, rituals, ceremonies, indigenous knowledge, social customs and traditions, arts, crafts, music, political and ideological beliefs that influence culture and behavior, history, practices concerning the natural environment, religious and scientific traditions etc.
artist: pradip kumar bajracharya
museum: museum of nepali arts
imageID: 5

title: dipankara buddha
about: Dīpankara embodies a Buddha of the past who attained Enlightenment eons before to Shakyamuni Buddha. He is believed to be the 24th predecessor of Gautama Buddha. Dīpankara is usually accompanied by the Bodhisattvas; Manjushri, Vajrapani or Avalokitesvara. In this painting, the artist presents Dīpankara as in the festival of Samyak Daan flanked by Dhyani Buddha Amitabha and Vairochana. The Newar Buddhist community consider him as a destroyer of evil, protector of merchants and associate him with alms-giving.
artist: prem man chitrakar
museum: museum of nepali arts
imageID: 6

title: family puja
about: For daily devotion, many Hindu families have a home shrine , often in a corner of the best room in the house. It is a way of honouring the gods and goddesses. Worship at the shrine may involve the whole family, or sometimes it is done alone. A daily puja ceremony uses all five of the senses.
artist: m m poon
museum: null
imageID: 7

title: ganesha
about: Commonly referred as Vinayaka, Ganesha is widely revered as the remover of obstacles, the patron of art and science and the god of intellect and wisdom. He is honored as the first deity to be
worshipped during rites and ceremonies. In this painting, Tuladhar has placed Ganesha in front of an element mandala with the sun and moon at the top two corners.
artist: raj prakash man tuladhar
museum: museum of nepali arts
imageID: 8

title: green tara
about: The spiritual consort of Dhyani Buddha Amoghasiddhi, the Green Tara, represented by the color of her skin, is the protectress from all obstacles and dangers. She is the embodiment of the element of air and she is symbolized by the green (here blue) night or closed lotus.
artist: samundra man singh shrestha
museum: museum of nepali arts
imageID: 9

title: guheshwori
about: According to Buddhist legends, from the root of the lotus seed thrown by Vipaswi Buddha in the lake that was Kathmandu Valley, emerged Guheswori. The Hindus believe that Guheswori is the reproductive part of Satidevi, wife of Lord Shiva. Thus, both religions 
give her the symbol of procreation.
Manjushri, founder of Kathmandu Valley visualized this goddess while carrying out rituals to drain the water out of the Valley. She is also called “Nairatma Devi”, the one who is blue, and signifies the wisdom of emptiness. She is the 
emanation of Akshyobhya Buddha and is the consort of Hevajra. She carries a Karti (knife) in her right hand and the left carries a Khatwanga (long studded club) and Kapala (skull). The Goddess stands in Ardhapayanka (dancing position) and steps over a corpse.
artist: raj prakash man tuladhar
museum: museum of nepali arts
imageID: 10